In [89]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [90]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [91]:
df.FlightNumber[1]=10055
df.FlightNumber[3]=df.FlightNumber[2]+10
df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [92]:
df.FlightNumber=df.FlightNumber.astype(int)

In [93]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [94]:
df.drop('From',axis=1,inplace=True)

KeyError: ignored

In [95]:
a=[]
b=[]
for i in df.From_To:
  a.append(i.split("_")[0])
  b.append(i.split("_")[1])

df['from']=pd.DataFrame(a)
df['To']=pd.DataFrame(b)
df

            From_To  FlightNumber  ...      from         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN         10055  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [96]:
a=[]
for i in df['from']:
  a.append(i.capitalize())
df['from']=pd.DataFrame(a)
df

            From_To  FlightNumber  ...      from         To
0      LoNDon_paris         10045  ...    London      paris
1      MAdrid_miLAN         10055  ...    Madrid      miLAN
2  londON_StockhOlm         10065  ...    London  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

In [97]:
b=[]
for i in df['To']:
  b.append(i.capitalize())
df['To']=pd.DataFrame(b)
df

            From_To  FlightNumber  ...      from         To
0      LoNDon_paris         10045  ...    London      Paris
1      MAdrid_miLAN         10055  ...    Madrid      Milan
2  londON_StockhOlm         10065  ...    London  Stockholm
3    Budapest_PaRis         10075  ...  Budapest      Paris
4   Brussels_londOn         10085  ...  Brussels     London

[5 rows x 6 columns]

In [100]:
df.drop('From_To',axis=1,inplace=True)

In [101]:
df

   FlightNumber  RecentDelays              Airline      from         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [130]:
e=[]
for i in df.RecentDelays:
  e.append(len(i))
max(e)

3

In [123]:
c=[]
for i in df.RecentDelays:
  if len(i)==0:
    c.append(0)
  else:
    c.append(i[0])
df['delay_1']=pd.DataFrame(c)
df

   FlightNumber  RecentDelays  ...         To delay_1
0         10045      [23, 47]  ...      Paris      23
1         10055            []  ...      Milan       0
2         10065  [24, 43, 87]  ...  Stockholm      24
3         10075          [13]  ...      Paris      13
4         10085      [67, 32]  ...     London      67

[5 rows x 6 columns]

In [128]:
d=[]
for i in df.RecentDelays:
  if len(i)<2:
    d.append(0)
  else:
    d.append(i[1])
df['delay_2']=pd.DataFrame(d)
df

   FlightNumber  RecentDelays              Airline  ...         To delay_1  delay_2
0         10045      [23, 47]               KLM(!)  ...      Paris      23       47
1         10055            []    <Air France> (12)  ...      Milan       0        0
2         10065  [24, 43, 87]  (British Airways. )  ...  Stockholm      24       43
3         10075          [13]       12. Air France  ...      Paris      13        0
4         10085      [67, 32]          "Swiss Air"  ...     London      67       32

[5 rows x 7 columns]

In [131]:
e=[]
for i in df.RecentDelays:
  if len(i)<3:
    e.append(0)
  else:
    e.append(i[2])
df['delay_3']=pd.DataFrame(e)
df

   FlightNumber  RecentDelays              Airline  ... delay_1 delay_2  delay_3
0         10045      [23, 47]               KLM(!)  ...      23      47        0
1         10055            []    <Air France> (12)  ...       0       0        0
2         10065  [24, 43, 87]  (British Airways. )  ...      24      43       87
3         10075          [13]       12. Air France  ...      13       0        0
4         10085      [67, 32]          "Swiss Air"  ...      67      32        0

[5 rows x 8 columns]

In [132]:
df.drop('RecentDelays',axis=1,inplace=True)

In [133]:
df

   FlightNumber              Airline      from  ... delay_1  delay_2  delay_3
0         10045               KLM(!)    London  ...      23       47        0
1         10055    <Air France> (12)    Madrid  ...       0        0        0
2         10065  (British Airways. )    London  ...      24       43       87
3         10075       12. Air France  Budapest  ...      13        0        0
4         10085          "Swiss Air"  Brussels  ...      67       32        0

[5 rows x 7 columns]

In [136]:
df1=df[['from','To','FlightNumber','delay_1','delay_2','delay_3','Airline']]

In [137]:
df1

       from         To  FlightNumber  ...  delay_2  delay_3              Airline
0    London      Paris         10045  ...       47        0               KLM(!)
1    Madrid      Milan         10055  ...        0        0    <Air France> (12)
2    London  Stockholm         10065  ...       43       87  (British Airways. )
3  Budapest      Paris         10075  ...        0        0       12. Air France
4  Brussels     London         10085  ...       32        0          "Swiss Air"

[5 rows x 7 columns]